# Regex patterns for act abbreviations

ACT_ABBREVIATIONS = {
  r'.*гражданский кодекс.*': 'ГК РФ',
  r'.*арбитражный процессуальный кодекс.*': 'АПК РФ',
  r'.*гражданский процессуальный кодекс.*': 'ГПК РФ',
  r'.*кодекс административного судопроизводства.*': 'КАС РФ',
  r'.*уголовный кодекс.*': 'УК РФ',
  r'.*уголовно-процессуальный кодекс.*': 'УПК РФ',
  r'.*кодекс об административных правонарушениях.*': 'КоАП РФ',
  r'.*налоговый кодекс.*': 'НК РФ',
  r'.*трудовой кодекс.*': 'ТК РФ',
  r'.*семейный кодекс.*': 'СК РФ',
  r'.*земельный кодекс.*': 'ЗК РФ',
  r'.*жилищный кодекс.*': 'ЖК РФ',
}

ACT_REGEX_PATTERNS = {
  r'.*гк рф.*': 'ГК РФ',
  r'.*апк рф.*': 'АПК РФ',
  r'.*гпк рф.*': 'ГПК РФ',
  r'.*кас рф.*': 'КАС РФ',
  r'.*ук рф.*': 'УК РФ',
  r'.*упк рф.*': 'УПК РФ',
  r'.*коап рф.*': 'КоАП РФ',
  r'.*нк рф.*': 'НК РФ',
  r'.*тк рф.*': 'ТК РФ',
  r'.*ск рф.*': 'СК РФ',
  r'.*зк рф.*': 'ЗК РФ',
  r'.*жк рф.*': 'ЖК РФ',
}
